Code for scraping from indeed.co.uk

In [3]:
#import packages
import requests, bs4, time
import pandas as pd
import os
from itertools import cycle
import traceback
from datetime import date
from langdetect import detect
import pickle
import numpy as np
import datetime
import cleaning_funcs_indeed_uk as cf
import urllib
import json
import pickle

In [15]:
os.chdir('Cleaning/')
path = os.getcwd()

In [5]:
#if all files are being processed
files = []
for i in os.listdir('C:/Users/lundr/DataScienceJobs/data/indeed_raw_pickles/'):
    if '2019-12-05' in i:
        files.append(i)
#files = os.listdir('C:/Users/lundr/DataScienceJobs/data/indeed_raw_pickles/')
files
# otherwise select the file(s) you want
#files = ['RAW_indeeduk_data+analyst2019-11-21.pkl','RAW_indeeduk_data+scientist2019-11-20.pkl' ]

['RAW_indeeduk_AI Scientist2019-12-05.pkl',
 'RAW_indeeduk_business+intelligence2019-12-05.pkl',
 'RAW_indeeduk_CRM+manager2019-12-05.pkl',
 'RAW_indeeduk_data+analyst2019-12-05.pkl',
 'RAW_indeeduk_data+analytics2019-12-05.pkl',
 'RAW_indeeduk_data+engineer2019-12-05.pkl',
 'RAW_indeeduk_data+manager2019-12-05.pkl',
 'RAW_indeeduk_data+science2019-12-05.pkl',
 'RAW_indeeduk_data+security2019-12-05.pkl',
 'RAW_indeeduk_database+administrator2019-12-05.pkl',
 'RAW_indeeduk_database+developer2019-12-05.pkl',
 'RAW_indeeduk_econometrics2019-12-05.pkl',
 'RAW_indeeduk_insight+analytics2019-12-05.pkl',
 'RAW_indeeduk_Machine+Learning+Engineer2019-12-05.pkl',
 'RAW_indeeduk_solutions+architect2019-12-05.pkl',
 'RAW_indeeduk_statistics2019-12-05.pkl']

In [6]:
# readin raw pickle files

ads= pd.DataFrame(columns = ['company', 'job_title', 'salary', 'location', 'description', 'date',
       'full_description', 'other_deets', 'jobtype', 'salary_low',
       'salary_high','extraction_date'])

import os


for i in files:
    
    read_in = pd.read_pickle("C:/Users/lundr/DataScienceJobs/data/indeed_raw_pickles/"+i)
    ads = pd.concat([ads,read_in],ignore_index = True, axis = 0, sort=True)

In [7]:
#drop rows with identical descriptions
ads = ads.drop_duplicates(['description'])

#reset index after dropping duplicated
ads.reset_index(inplace=True)

In [8]:
ads.shape

(11144, 13)

In [9]:
# clean data and create additional variables

ads['location'],ads['salary'],ads['jobtype'] = cf.clean_other_deets(ads['other_deets'])
ads['location'] = ads['location'].apply(lambda x: x.lstrip().rstrip() if pd.notnull(x) else x)
ads['full_description'] = cf.clean_column(ads['full_description'])
ads['company'] = cf.clean_column(ads['company'])
ads['salary_low'], ads['salary_high'],ads['salary_type'] = cf.create_split_salary_range(ads['salary'])
ads['salary_low']=cf.clean_salary(ads['salary_low'],"£")
ads['salary_high']=cf.clean_salary(ads['salary_high'],"£")
ads['days_from_post'] = cf.create_days_from_post(ads['date'])
ads['posted_date'] = cf.create_posted_date(ads['days_from_post'],ads['extraction_date'])

ads['salary_type'] = ads['salary_type'].str.replace('n ',"")
ads['salary_type'] = ads['salary_type'].str.replace(r"[\"\',]", '')
ads['salary_type'] = ads['salary_type'].str.replace(r" ", '')
ads['country']='UK'
ads['salary_type'] = cf.clean_salary_type(ads['salary_type'])

C:\Users\lundr\DataScienceJobs\Cleaning\cleaning_funcs_indeed_uk.py:71: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pandas_df_col[i] = str(pandas_df_col[i]).strip('[]')
C:\Users\lundr\DataScienceJobs\Cleaning\cleaning_funcs_indeed_uk.py:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if type(a[i])!="str":a[i]=str(a[i])
C:\Users\lundr\DataScienceJobs\Cleaning\cleaning_funcs_indeed_uk.py:18: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a[i]=(pattern.sub(lambda m: rep[re.escape(m.group(0))],a[i]))

In [10]:
# check for salary anomalies and manually correct if needed
idx = ads.loc[ads['salary_high'] != 'None']
idx[idx['salary_high']/idx['salary_low']>3]
#

,index,company,date,description,extraction_date,full_description,job_title,jobtype,location,other_deets,salary,salary_high,salary_low,salary_type,days_from_post,posted_date,country
2785,6924,myfuturerole.com,1 day ago,\n Experience liaising with engineers and clie...,2019-12-05,"Maintenance administrator £24,000 London Bridg...",Maintenance Administrator,"Full-time, Permanent",London,"London_Full-time, Permanent_£24,000 - £220,000...","£24,000 - £220,000 a year",220000,24000,yearly,1,2019-12-04,UK
6795,32137,Carlill-Yates Recruitment Ltd,1 day ago,\n We are currently looking for an experienced...,2019-12-05,We are currently looking for an experienced Mo...,Mortgage Advisor,"Full-time, Commission, Permanent",Enfield,"Enfield_Full-time, Commission, Permanent_£25,0...","£25,000 - £80,000 a year",80000,25000,yearly,1,2019-12-04,UK

In [11]:
ads['salary_high'][2785] = 24000
ads['salary_low'][2785] = 22000

#ads['salary_low'][57,155,194] = 15000
#ads['salary_high'][57,155,194] = 16000

C:\Users\lundr\AppData\Local\Continuum\anaconda3\envs\dsj\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\lundr\AppData\Local\Continuum\anaconda3\envs\dsj\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [12]:
#generate salary average after correction
ads['salary_average'] = cf.salary_average(ads['salary_low'],ads['salary_high'])

In [13]:
# force salary data to numeric
GBP = 1.14

ads['salary_average'] = pd.to_numeric(ads['salary_average'],errors='coerce')
ads['salary_low'] = pd.to_numeric(ads['salary_low'],errors='coerce')
ads['salary_high'] = pd.to_numeric(ads['salary_high'],errors='coerce')


# convert sary values to euros
ads['salary_average_euros'] = ads['salary_average']*GBP
ads['salary_low_euros'] = ads['salary_low']*GBP
ads['salary_high_euros'] = ads['salary_high']*GBP

In [78]:
# match locations to regions
ads['location']= ads['location'].apply(lambda x: str(x))
ads['Region'] = cf.check_locations(ads['location'],ads['country'])

#take first value from the string returned for regions
ads['Region'] = ads['Region'].apply(lambda x: x.split(",")[0])

In [79]:
ads['Region'].unique()

array(['London', 'South East', 'West Midlands', 'East of England',
       'Scotland', 'Yorkshire and The Humber', 'North West',
       'East Midlands', 'UK Unknown', 'Northern Ireland', 'South West',
       'North East', 'Wales', '', 'Offshore'], dtype=object)

In [76]:
import importlib
importlib.reload(cf)

In [80]:
# search for unmatched regions
for i in range(len(ads)):
    if ads['Region'][i]=='' and ads['location'][i]!='' :
        ads['Region'][i] = cf.region_from_nominatim(ads['location'][i])
    else:
        pass

C:\Users\lundr\AppData\Local\Continuum\anaconda3\envs\dsj\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [65]:
ads.loc[i]
search_query = urllib.parse.quote(ads['location'][i])
'https://nominatim.openstreetmap.org/search/'+search_query+"?format=json&addressdetails=1&limit=1"

'https://nominatim.openstreetmap.org/search/Betchworth%5B3%5D%20RH4?format=json&addressdetails=1&limit=1'

In [81]:
#Check that all areas are being picked up
#len(ads[ads['Region']=='']['location'].unique())
ads[ads['Region']=='']['location'].unique()

array([''], dtype=object)

In [77]:
# with open(path + '/data/cleaning_in_progress.pkl', 'wb') as file:
#     pickle.dump(ads, file)

with open('C:/Users/lundr/DataScienceJobs/data/cleaning_in_progress.pkl', 'rb') as file:
    ads = pickle.load(file)

In [82]:
ads['Region'].unique()

array(['London', 'South East', 'West Midlands', 'East of England',
       'Scotland', 'Yorkshire and The Humber', 'North West',
       'East Midlands', 'UK Unknown', 'Northern Ireland', 'South West',
       'North East', 'Wales', 'Offshore', '', 'Greater London'],
      dtype=object)

In [83]:
ads[ads['Region']=='']['location'].unique()

array([''], dtype=object)

In [84]:
ads.loc[ads['Region']=='',['Region']]='UK Unknown'

In [85]:
# some places have multiple matches, create dictionary to correct

corrections = {"brentwood" :"East",
"kingston upon thames": "London",
"richmond upon thames" : "London",
"kentish town" : "London",
"hartlepool" : "North East",
"hemel hempstead" : "East",
"chesterfield" : "East Midlands",
"rotherham" : "Yorkshire and the Humber",
"london bridge station" : "London",
"sutton-in-ashfield" : "East Midlands",
"newcastle-under-lyme" : "West Midlands",
"great chesterford" : "East",
 "bridgend cf31" : "Wales"}

for i in range(len(ads['location'])):
     if ads['location'][i].lower() in corrections.keys():
        ads.loc[ads['location']==ads['location'][i],'Region'] = corrections[ads['location'][i].lower()]

In [86]:
# # standardize formats for regions 
# ads['Region'] = [str(x) for x in ads['Region']]
# ads['Region'] = [x.lower() for x in ads['Region']]

In [87]:
# make sure all missing values are np.nan
for x in range(ads.shape[0]):
    for y in range(ads.shape[1]):
        if ads.iloc[x,y] =='None' or ads.iloc[x,y] =='Nothing_found':
            ads.iloc[x,y] = np.nan

In [88]:
# job_title, company, description, salary, salary_low, salary_high, salary_average,salary_low_euros, salary_high_euros, salary_average_euros,  location, jobtype,posted_date, extraction_date, country, region
# job refcode
ads['currency'] = ads['country']
ads['currency'] =ads['currency'].map({"UK":"£","GER":"€","USA":"$"})
ads['ref_code'] = np.nan
ads['url'] = np.nan
ads['language'] = ads.description.apply(detect)
ads['region'] = ads['Region']
data_to_database = ads[['job_title','ref_code', 'company', 'description', 'salary', 'salary_low', 'salary_high','currency','salary_average','salary_low_euros', 'salary_high_euros', 'salary_average_euros', 'salary_type', 'location', 'jobtype','posted_date', 'extraction_date', 'country','url','region','language']]

In [89]:
data_to_database

,job_title,ref_code,company,description,salary,salary_low,salary_high,currency,salary_average,salary_low_euros,...,salary_average_euros,salary_type,location,jobtype,posted_date,extraction_date,country,url,region,language
0,Data Scientist,NaN,ctrlio Ltd,\n Experience using quantitative data analysis...,NaN,NaN,NaN,£,NaN,NaN,...,NaN,NaN,London,NaN,2019-12-05,2019-12-05,UK,NaN,London,en
1,Data Scientist,NaN,Orange,\n Data scientist who will know:Our data arise...,NaN,NaN,NaN,£,NaN,NaN,...,NaN,NaN,Paddington,NaN,2019-12-05,2019-12-05,UK,NaN,London,en
2,Assoc Stat Programming Dir,NaN,IQVIA,\n IQVIA is looking to appoint Associate Stati...,NaN,NaN,NaN,£,NaN,NaN,...,NaN,NaN,Reading,Part-time,2019-12-05,2019-12-05,UK,NaN,South East,en
3,Senior Data Analyst,NaN,Amazon EU SARL (UK Branch),\n Create data pipelines from a data lake to v...,NaN,NaN,NaN,£,NaN,NaN,...,NaN,NaN,London,NaN,2019-12-05,2019-12-05,UK,NaN,London,en
4,Calibration Support Intern - SCR,NaN,Bosch Group,\n Support detailed analysis and simulation of...,NaN,NaN,NaN,£,NaN,NaN,...,NaN,NaN,Coventry CV4,Internship,2019-12-05,2019-12-05,UK,NaN,West Midlands,en
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
11139,Junior Quantitative Researcher,NaN,ADR Markets,"\n Requirements: Master or PhD in math’s, phys...","£50,000 a year",50000.0,50000.0,£,50000.0,57000.00,...,57000.00,yearly,London,"Full-time, Permanent",2019-11-27,2019-12-05,UK,NaN,London,en
11140,Accountant,NaN,HTC Europe Ltd,\n Support Supervisor to manage the local comp...,NaN,NaN,NaN,£,NaN,NaN,...,NaN,NaN,Slough SL1,"Full-time, Permanent",2019-11-26,2019-12-05,UK,NaN,South East,en
11141,Technical Support Engineer,NaN,North of England Commissioning Support,\n Do you have specialist knowledge of inciden...,"£30,401 - £37,267 a year",30401.0,37267.0,£,33834.0,34657.14,...,38570.76,yearly,Leeds,NaN,2019-11-27,2019-12-05,UK,NaN,Yorkshire and The Humber,en
11142,Contract Delivery Manager,NaN,UnitedHealth Group,"\n Provide regular updates, reporting and stat...",NaN,NaN,NaN,£,NaN,NaN,...,NaN,NaN,Aberdeen,NaN,2019-11-27,2019-12-05,UK,NaN,Scotland,en
11143,Software Engineer - Core Engines,NaN,Genomics plc,"\n Critical thinking skills, familiarity with ...",NaN,NaN,NaN,£,NaN,NaN,...,NaN,NaN,Oxford,NaN,2019-11-26,2019-12-05,UK,NaN,South East,en

In [98]:
import os 
os.getcwd()
os.chdir('..')

'C:\\Users\\lundr\\DataScienceJobs'

In [4]:
#data_to_database = pd.read_pickle('data/indeed_uk_CLEANData_Scientist+data_analyst2019-11-21.pkl')

In [99]:
#pickle out to keep a copy and then push to the database
# searchTerm = 'Data_Scientist+data_analyst'
# data_to_database.to_pickle("C:/Users/lundr/DataScienceJobs/data/indeed_uk_CLEAN"+searchTerm+str(date.today())+".pkl")

PASSWORD = pd.read_pickle('C:/Users/lundr/DataScienceJobs/data/SQL_Access.pkl')

import SQL.db_upload as db

db.db_upload(PASSWORD, data_to_database)

Landing page is currently empty.

Uploading data to landing page...
Done!

In [103]:
import psycopg2
from sqlalchemy import create_engine
import pandas as pd

path = 'C:/Users/lundr/DataScienceJobs/'
# calls in SQL
#connect to the database
PASSWORD = pd.read_pickle('C:/Users/lundr/DataScienceJobs/data/SQL_access.pkl')
engine = create_engine('postgresql://postgres:'+PASSWORD+'@dsj-1.c9mo6xd9bf9d.us-west-2.rds.amazonaws.com:5432/')

country_regions = pd.read_sql(''' SELECT country, region FROM landing ''', engine)

loc_UK = pd.read_csv(path + '/data/uk_location_lookup.csv')['region'].unique()
loc_GER = pd.read_csv(path + '/data/locations.csv')['region'].unique()
loc_USA = pd.read_csv(path + '/data/us-states.csv')['region'].unique()

country_region_dict={'UK':list(loc_UK),
                    'Germany': list(loc_GER),
                    'USA': list(loc_USA)
}

In [111]:
pd.read_sql('''SELECT region FROM landing ''', engine)['region'].unique()

array(['London', 'South East', 'West Midlands', 'East of England',
       'Scotland', 'Yorkshire and The Humber', 'North West',
       'East Midlands', 'UK Unknown', 'Northern Ireland', 'South West',
       'North East', 'Wales', 'Offshore'], dtype=object)

In [11]:
from sqlalchemy import create_engine
PASSWORD = pd.read_pickle('C:/Users/lundr/DataScienceJobs/data/SQL_password.pkl').iloc[0,0]
engine = create_engine('postgresql://postgres:'+PASSWORD+'@dsj-1.c9mo6xd9bf9d.us-west-2.rds.amazonaws.com:5432/')
pd.read_sql('''SELECT region FROM landing''', engine)['region'].unique()

array(['South East', 'London', 'West Midlands', 'North West',
       'North East', 'South West', 'Scotland', 'East of England',
       'Yorkshire and The Humber', 'East Midlands', 'UK Unknown',
       'Northern Ireland', 'Wales', 'Offshore',
       'Yorkshire and the Humber'], dtype=object)

In [ ]:
engine.execute(''' UPDATE TABLE landing''')

In [29]:

table_data = ads[ads['salary_type']=='yearly']
#table_data.reset_index(inplace=True)
table_data.groupby(by='Region').agg({'salary_average' : ['count','median','mean','max','min']}).reset_index().sort_values(by =('salary_average', 'mean'))

                      Region salary_average                                   \
                                      count   median          mean       max
0                       East              1  23000.0  23000.000000   23000.0
1              East Midlands              2  27208.0  27208.000000   33916.0
4                 North East              1  29188.0  29188.000000   29188.0
5                 North West             11  32816.0  32665.090909   72500.0
11             West Midlands              8  35632.0  34833.625000   52500.0
8                 South West             12  32500.0  36762.000000   75000.0
6                   Scotland              5  40000.0  38457.800000   52500.0
7                 South East             29  35922.0  38740.620690   80000.0
10                     Wales              5  47712.0  42809.200000   55000.0
9                 UK Unknown             10  46250.0  46300.000000   75500.0
12  Yorkshire and The Humber              2  48653.0  48653.000000   52306.0
2            East of England             13  65000.0  57281.230769   87500.0
3                     London            120  61646.0  63100.141667  152500.0


        min
0   23000.0
1   20500.0
4   29188.0
5   15000.0
11  22500.0
8   16436.0
6   14250.0
7    6000.0
10  22500.0
9   16500.0
12  45000.0
2   17000.0
3   15500.0

In [18]:
ads[(ads['Region']=='East Midlands') & (ads['salary_average'] < 15000)]

,index,company,date,description,extraction_date,full_description,job_title,jobtype,location,other_deets,...,country,salary_average,salary_average_euros,salary_low_euros,salary_high_euros,Region,currency,ref_code,url,region
191,408,Beauhurst,18 days ago,\n You’ll have or be working towards a degree ...,2019-11-13,About you We’re looking for someone who’s dili...,Data Intern – Nottingham,Internship,Nottingham,Nottingham_Internship_£300 a week,...,UK,300.0,342.00,342.000,342.0000,East Midlands,£,NaN,NaN,East Midlands
238,523,Catch Resource Management Ltd,30+ days ago,\n Our leading end user client is currently lo...,2019-11-13,Our leading end user client is currently looki...,Business Intelligence Analyst,Contract,Leicestershire,Leicestershire_Contract_£400 - £500 a day,...,UK,450.0,513.00,456.000,570.0000,East Midlands,£,NaN,NaN,East Midlands
1901,4431,Clark James Ltd,Just posted,\n Clark James are an established recruitment ...,2019-11-13,Clark James are an established recruitment bus...,Data Manager / Resourcer,Part-time,Caistor,Caistor_Part-time_£8.30 - £8.31 an hour,...,UK,8.0,9.12,9.462,9.4734,East Midlands,£,NaN,NaN,East Midlands
2711,7504,Leicester College,2 days ago,\n You will provide a comprehensive welfare an...,2019-11-13,Welfare Assistant Student Services Part Time...,Welfare Assistant,None,Leicester,"Leicester_£8,771 - £9,480 a year",...,UK,9125.0,10402.50,9998.940,10807.2000,East Midlands,£,NaN,NaN,East Midlands
2761,7576,Leicester College,6 days ago,\n Part Time (18.5 hours to be worked Wed - Fr...,2019-11-13,Welfare Advisor Student Services Part Time (...,Welfare Advisor,None,Leicester,"Leicester_£12,095 - £12,987 a year",...,UK,12541.0,14296.74,13788.300,14805.1800,East Midlands,£,NaN,NaN,East Midlands
2784,7612,Leicester College,7 days ago,\n We will store your details for a period of ...,2019-11-13,Part Time Lecturers Skills for Life Maths an...,Part Time Lecturer,Part-time,Leicester,Leicester_Part-time_£20.30 - £22.50 an hour,...,UK,21.0,23.94,23.142,25.6500,East Midlands,£,NaN,NaN,East Midlands
4171,10645,SF Group,6 days ago,\n The Data Analyst will be responsible for ma...,6-11-2019,SF Recruitment is currently recruiting for a T...,Temporary Data Analyst,Temporary,Nottingham,Nottingham_Temporary_£12.75 an hour,...,UK,12.0,13.68,14.535,14.5350,East Midlands,£,NaN,NaN,East Midlands

In [61]:
np.mean(table_data['salary_average'])

39204.90817064353

In [169]:
table_data[table_data['salary_low']>2000].groupby(['Region']).agg({'salary_average' : ['sum']}).reset_index()

                      Region salary_average
                                        sum
0                        0.0      7224610.0
1              east midlands      2867602.0
2            east of england      5807767.0
3                isle of man        75000.0
4                     london     49782311.0
5                 north east      1173608.0
6                 north west      5528399.0
7           northern ireland        63500.0
8                     remote       353000.0
9                   scotland      1840365.0
10                south east     11882848.0
11                south west      5884992.0
12                        uk      2704878.0
13                   unknown       344007.0
14                     wales      1707453.0
15             west midlands      6695238.0
16  yorkshire and the humber      4383188.0

In [76]:
table_data[table_data['salary_low']>2000].groupby(['Region']).mean().reset_index()

,Region,index,industry,education,career,ref_code
0,0,11557.141844,NaN,NaN,NaN,NaN
1,Belfast,10341.000000,NaN,NaN,NaN,NaN
2,East,8414.854167,NaN,NaN,NaN,NaN
3,East Midlands,8727.572917,NaN,NaN,NaN,NaN
4,East midlands,9396.000000,NaN,NaN,NaN,NaN
5,East of England,9411.188525,NaN,NaN,NaN,NaN
6,Isle of Man,9155.000000,NaN,NaN,NaN,NaN
7,Kent,6292.666667,NaN,NaN,NaN,NaN
8,London,10014.237234,NaN,NaN,NaN,NaN
9,London,18272.000000,NaN,NaN,NaN,NaN
10,North West,15532.333333,NaN,NaN,NaN,NaN
11,North East,9259.352941,NaN,NaN,NaN,NaN
12,North West,7741.777778,NaN,NaN,NaN,NaN
13,Remote,9337.333333,NaN,NaN,NaN,NaN
14,Scotland,8293.705882,NaN,NaN,NaN,NaN
15,South East,8899.344948,NaN,NaN,NaN,NaN
16,South Essex,4222.000000,NaN,NaN,NaN,NaN
17,South West,8631.875776,NaN,NaN,NaN,NaN
18,UK,8642.932203,NaN,NaN,NaN,NaN
19,Unknown,7235.444444,NaN,NaN,NaN,NaN
20,Wales,7379.549020,NaN,NaN,NaN,NaN
21,West Midlands,16758.333333,NaN,NaN,NaN,NaN
22,West Midlands,8019.529070,NaN,NaN,NaN,NaN
23,West Yorkshire,11815.500000,NaN,NaN,NaN,NaN
24,Yorkshire and The Humber,8860.876289,NaN,NaN,NaN,NaN
25,Yorkshire and the humber,7386.529412,NaN,NaN,NaN,NaN

In [ ]:
# generate missing columns
# drop unneeded columns
ads = ads.drop(['description', 'other_deets'], axis=1)